/*
    # 문제
    하샤드 수

    # 문제 설명
    양의 정수 x가 하샤드 수이려면 x의 자릿수의 합으로 x가 나누어져야 합니다.
    예를 들어 18의 자릿수 합은 1+8=9이고, 18은 9로 나누어 떨어지므로 18은 하샤드 수입니다.
    자연수 x를 입력받아 x가 하샤드 수인지 아닌지 검사하는 함수, solution을 완성해주세요.

    # 제한 조건
    x는 1 이상, 10000 이하인 정수입니다.

    # 입출력 예
    arr	    return
    10	    true
    12	    true
    11	    false
    13	    false

    # 입출력 예 설명
    입출력 예 #1
    10의 모든 자릿수의 합은 1입니다. 10은 1로 나누어 떨어지므로 10은 하샤드 수입니다.

    입출력 예 #2
    12의 모든 자릿수의 합은 3입니다. 12는 3으로 나누어 떨어지므로 12는 하샤드 수입니다.

    입출력 예 #3
    11의 모든 자릿수의 합은 2입니다. 11은 2로 나누어 떨어지지 않으므로 11는 하샤드 수가 아닙니다.

    입출력 예 #4
    13의 모든 자릿수의 합은 4입니다. 13은 4로 나누어 떨어지지 않으므로 13은 하샤드 수가 아닙니다.
*/

const test01 = (x) => {
    let result = 0;

    String(x).split('').map(el => result += Number(el));

    return x % result === 0;
}

console.log(test01(10))

  /*
      # 문제풀이 - test01
      1. 누적해서 더할 num타입의 변수를 생성해놓는다.
      2. num타입의 파라미터를 str타입으로 바꿔준 뒤 자릿수를 나눠주기 위해 split메소드를 활용하였다. 배열로 바뀐 형태에 map메소드를 활용하여
      생성해놓은 num타입의 변수에 누적해서 더해주었다.
      3. 최종 출력 값은 나머지 값이 0인 경우를 비교하여 출력하였다.
  */


const test02 = (x) => {
    return x % String(x).split('').reduce((pre, cur) => Number(pre) + Number(cur)) === 0;
}

console.log(test02(10))

  /*
      # 문제풀이 - test02
      1. num타입의 파라미터를 str타입으로 바꿔준 뒤 자릿수를 나눠주기 위해 split메소드를 활용하였다. 배열로 바뀐 형태에 reduce메소드를 활용하여
      배열의 모든 값을 더해주었다.
      3. 최종 출력 값은 나머지 값이 0인 경우를 비교하여 출력하였다.
  */


function test03(x) {
    let arrString = x + "";
    let arrSum = 0;

    for(let i = 0; i < arrString.length; i++){
        arrSum += Number(arrString[i]);
    }

    return x % arrSum === 0;
}

console.log(test03(10))

  /*
      # 문제풀이 - test03
      1. 누적해서 더할 num타입의 변수를 생성해놓는다.
      2. 파라미터를 str타입으로 바꿔주기 위한 변수를 생성한다.
      2. 반복문을 활용하여 누적해서 더할 변수에 전달받은 파라미터의 요소를 돌며 값을 더해준다.
      3. 최종 출력 값은 나머지 값이 0인 경우를 비교하여 출력하였다.
  */